<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use App\Models\Post;

class PostsTableSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        $param = [
            'title' => '制作進捗いい感じだよ制作進捗いい感じだよ',
            'content' => 'かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。',
            'tag_id' => '1',
            'user_id'=>'1',
        ];
        Post::create($param);
        $param = [
            'title' => '制作進捗いい感じだよ制作進捗いい感じだよ',
            'content' => 'かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。',
            'tag_id' => '2',
            'user_id'=>'2',
        ];
        Post::create($param);
        $param = [
            'title' => '制作進捗いい感じだよ制作進捗いい感じだよ',
            'content' => 'かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。',
            'tag_id' => '3',
            'user_id'=>'3',
        ];
        Post::create($param);
        $param = [
            'title' => '制作進捗いい感じだよ制作進捗いい感じだよ',
            'content' => 'かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。',
            'tag_id' => '1',
            'user_id'=>'2',
        ];
        Post::create($param);
        $param = [
            'title' => '制作進捗いい感じだよ制作進捗いい感じだよ',
            'content' => 'かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。かわいい衣装ができたよ。',
            'tag_id' => '2',
            'user_id'=>'3',
        ];
        Post::create($param);
    }
}
